# BarTypeDiameterOptions Constructor (RebarBarType) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BarTypeDiameterOptions Constructor (RebarBarType)
BarTypeDiameterOptions Class See Also
---
Constructs a new BarTypeDiameterOptions copying the diameter information from the bar type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public BarTypeDiameterOptions(
	RebarBarType barType
)
```

Visual Basic
---
```text
Public Sub New ( _
	barType As RebarBarType _
)
```

Visual C++
---
```text
public:
BarTypeDiameterOptions(
	RebarBarType^ barType
)
```

# ### Parameters
barType
    Type: Autodesk.Revit.DB.Structure..::..RebarBarType
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BarTypeDiameterOptions Class
BarTypeDiameterOptions Overload
Autodesk.Revit.DB Namespace